class JsonDataProvider {
  //static final jsonMainData = ();

/*  for (var table in excel.tables.keys) {
  //print(excel.tables[table].maxCols);
  //print(excel.tables[table].maxRows);
  for (var row in excel.tables[table].rows) {
  jsonMainData().
    print("$row");
  }
  }*/

  static final jsonMainData = '['
      '{"Модель": "iRU 511MT", "Серийный номер": "123123awda232","Номер продукта": "awdajl2123adw2",'
      '"Инвентрный номер": 1,"ФИО": "Мамонтов Дональд Альвианович","Статус": "Выдан","Номер пломбы": 13,"Дата чистки": "21.02.23",'
      '"Заметки": "Помят корпус"},{ "Модель": "iRU 511MT","Серийный номер": "123123awda233","Номер продукта": "awdajl2123adp5","Инвентрный номер": 2,'
      '"ФИО": "Русаков Венедикт Егорович","Статус": "Чистка","Номер пломбы": 14,"Дата чистки": "22.02.23"}, {"Модель": "iRU 511MT","Серийный номер": "123123awda234",'
      '"Номер продукта": "awdajl2123adw3","Инвентрный номер": 3,"ФИО": "Иванков Юлиан Кимович","Статус": "Выдан","Номер пломбы": 15,"Дата чистки": "23.02.23"},{'
      '"Модель": "iRU 511MT","Серийный номер": "123123awda235","Номер продукта": "awdajl2123adp6","Инвентрный номер": 4,"ФИО": "Никитин Ермолай Онисимович","Статус": "Склад",'
      '"Номер пломбы": 16,"Дата чистки": "24.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda236","Номер продукта": "awdajl2123adw4","Инвентрный номер": 5,'
      '"ФИО": "Михайлов Трофим Артёмович","Статус": "Склад","Номер пломбы": 17,"Дата чистки": "25.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda237",'
      '"Номер продукта": "awdajl2123adp7","Инвентрный номер": 6,"ФИО": "Никонов Харитон Мартынович","Статус": "Выдан","Номер пломбы": 18,"Дата чистки": "26.02.23"},'
      '{"Модель": "iRU 511MT","Серийный номер": "123123awda238","Номер продукта": "awdajl2123adw5","Инвентрный номер": 7,"ФИО": "Голубев Юлий Глебович","Статус": '
      '"Чистка","Номер пломбы": 19,"Дата чистки": "27.02.23","Заметки": "Шумит вентелятор"},{"Модель": "iRU 511MT","Серийный номер": "123123awda239","Номер продукта": "awdajl2123adp8",'
      '"Инвентрный номер": 8,"ФИО": "Бобров Ипполит Эдуардович","Статус": "Выдан","Номер пломбы": 20,"Дата чистки": "28.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda240",'
      '"Номер продукта": "awdajl2123adw6","Инвентрный номер": 9,"ФИО": "Воронцов Аскольд Георгьевич","Статус": "Склад","Номер пломбы": 21,"Дата чистки": "01.03.23"'
      '},{"Модель": "iRU 511MT","Серийный номер": "123123awda241","Номер продукта": "awdajl2123adp9","Инвентрный номер": 10,"ФИО": "Коновалов Мартын Пантелеймонович",'
      '"Статус": "Склад","Номер пломбы": 22,"Дата чистки": "22.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda242","Номер продукта": "awdajl2123adw7",'
      '"Инвентрный номер": 11,"ФИО": "Никитин Даниил Ростиславович","Статус": "Выдан","Номер пломбы": 23,"Дата чистки": "23.02.23"},{"Модель": "Acer veriton",'
      '"Серийный номер": "123123awda243","Номер продукта": "awdajl2123adp10","Инвентрный номер": 12,"ФИО": "Муравьёв Вилен Данилович","Статус": "Чистка","Номер пломбы": 24,'
      '"Дата чистки": "27.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda244","Номер продукта": "awdajl2123adw8","Инвентрный номер": 13,"ФИО": "Суворов Витольд Пётрович",'
      '"Статус": "Выдан","Номер пломбы": 25,"Дата чистки": "28.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda245","Номер продукта": "awdajl2123adp11","Инвентрный номер": 14,'
      '"ФИО": "Никифоров Егор Арсеньевич","Статус": "Склад","Номер пломбы": 26,"Дата чистки": "01.03.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda246",'
      '"Номер продукта": "awdajl2123adw9","Инвентрный номер": 15,"ФИО": "Моисеев Семен Робертович","Статус": "Склад","Номер пломбы": 27,"Дата чистки": "22.02.23",'
      '"Заметки": "Заменен hdd"},{"Модель": "Acer veriton","Серийный номер": "123123awda247","Номер продукта": "awdajl2123adp12","Инвентрный номер": 16,'
      '"ФИО": "Овчинников Климент Ильяович","Статус": "Выдан","Номер пломбы": 28,"Дата чистки": "23.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda248",'
      '"Номер продукта": "awdajl2123adw10","Инвентрный номер": 17,"ФИО": "Мышкин Сергей Георгиевич","Статус": "Чистка","Номер пломбы": 29,"Дата чистки": "27.02.23"},'
      '{"Модель": "Acer veriton","Серийный номер": "123123awda249","Номер продукта": "awdajl2123adp13","Инвентрный номер": 18,"ФИО": "Дементьев Альберт Яковлевич",'
      '"Статус": "Выдан","Номер пломбы": 30,"Дата чистки": "28.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda250","Номер продукта": "awdajl2123adw11",'
      '"Инвентрный номер": 19,"ФИО": "Жданов Аверкий Артемович","Статус": "Склад","Номер пломбы": 31,"Дата чистки": "01.03.23"},{"Модель": "Acer veriton",'
      '"Серийный номер": "123123awda251","Номер продукта": "awdajl2123adp14","Инвентрный номер": 20,"ФИО": "Шестаков Абрам Макарович","Статус": "Склад","Номер пломбы": 32,'
      '"Дата чистки": "01.03.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda242","Номер продукта": "awdajl2123adw7",'
      '"Инвентрный номер": 11,"ФИО": "Никитин Даниил Ростиславович","Статус": "Выдан","Номер пломбы": 23,"Дата чистки": "23.02.23"},{"Модель": "Acer veriton",'
      '"Серийный номер": "123123awda243","Номер продукта": "awdajl2123adp10","Инвентрный номер": 12,"ФИО": "Муравьёв Вилен Данилович","Статус": "Чистка","Номер пломбы": 24,'
      '"Дата чистки": "27.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda244","Номер продукта": "awdajl2123adw8","Инвентрный номер": 13,"ФИО": "Суворов Витольд Пётрович",'
      '"Статус": "Выдан","Номер пломбы": 25,"Дата чистки": "28.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda245","Номер продукта": "awdajl2123adp11","Инвентрный номер": 14,'
      '"ФИО": "Никифоров Егор Арсеньевич","Статус": "Склад","Номер пломбы": 26,"Дата чистки": "01.03.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda246",'
      '"Номер продукта": "awdajl2123adw9","Инвентрный номер": 15,"ФИО": "Моисеев Семен Робертович","Статус": "Склад","Номер пломбы": 27,"Дата чистки": "22.02.23",'
      '"Заметки": "Заменен hdd"},{"Модель": "Acer veriton","Серийный номер": "123123awda247","Номер продукта": "awdajl2123adp12","Инвентрный номер": 16,'
      '"ФИО": "Овчинников Климент Ильяович","Статус": "Выдан","Номер пломбы": 28,"Дата чистки": "23.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda248",'
      '"Номер продукта": "awdajl2123adw10","Инвентрный номер": 17,"ФИО": "Мышкин Сергей Георгиевич","Статус": "Чистка","Номер пломбы": 29,"Дата чистки": "27.02.23"},'
      '{"Модель": "Acer veriton","Серийный номер": "123123awda249","Номер продукта": "awdajl2123adp13","Инвентрный номер": 18,"ФИО": "Дементьев Альберт Яковлевич",'
      '"Статус": "Выдан","Номер пломбы": 30,"Дата чистки": "28.02.23"},{"Модель": "Acer veriton","Серийный номер": "123123awda250","Номер продукта": "awdajl2123adw11",'
      '"Инвентрный номер": 19,"ФИО": "Жданов Аверкий Артемович","Статус": "Склад","Номер пломбы": 31,"Дата чистки": "01.03.23"},{"Модель": "Acer veriton",'
      '"Серийный номер": "123123awda251","Номер продукта": "awdajl2123adp14","Инвентрный номер": 20,"ФИО": "Шестаков Абрам Макарович","Статус": "Склад","Номер пломбы": 32,'
      '"Дата чистки": "01.03.23"},{"Модель": "iRU 511MT", "Серийный номер": "123123awda232","Номер продукта": "awdajl2123adw2",'
      '"Инвентрный номер": 1,"ФИО": "Мамонтов Дональд Альвианович","Статус": "Выдан","Номер пломбы": 13,"Дата чистки": "21.02.23",'
      '"Заметки": "Помят корпус"},{ "Модель": "iRU 511MT","Серийный номер": "123123awda233","Номер продукта": "awdajl2123adp5","Инвентрный номер": 2,'
      '"ФИО": "Русаков Венедикт Егорович","Статус": "Чистка","Номер пломбы": 14,"Дата чистки": "22.02.23"}, {"Модель": "iRU 511MT","Серийный номер": "123123awda234",'
      '"Номер продукта": "awdajl2123adw3","Инвентрный номер": 3,"ФИО": "Иванков Юлиан Кимович","Статус": "Выдан","Номер пломбы": 15,"Дата чистки": "23.02.23"},{'
      '"Модель": "iRU 511MT","Серийный номер": "123123awda235","Номер продукта": "awdajl2123adp6","Инвентрный номер": 4,"ФИО": "Никитин Ермолай Онисимович","Статус": "Склад",'
      '"Номер пломбы": 16,"Дата чистки": "24.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda236","Номер продукта": "awdajl2123adw4","Инвентрный номер": 5,'
      '"ФИО": "Михайлов Трофим Артёмович","Статус": "Склад","Номер пломбы": 17,"Дата чистки": "25.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda237",'
      '"Номер продукта": "awdajl2123adp7","Инвентрный номер": 6,"ФИО": "Никонов Харитон Мартынович","Статус": "Выдан","Номер пломбы": 18,"Дата чистки": "26.02.23"},'
      '{"Модель": "iRU 511MT","Серийный номер": "123123awda238","Номер продукта": "awdajl2123adw5","Инвентрный номер": 7,"ФИО": "Голубев Юлий Глебович","Статус": '
      '"Чистка","Номер пломбы": 19,"Дата чистки": "27.02.23","Заметки": "Шумит вентелятор"},{"Модель": "iRU 511MT","Серийный номер": "123123awda239","Номер продукта": "awdajl2123adp8",'
      '"Инвентрный номер": 8,"ФИО": "Бобров Ипполит Эдуардович","Статус": "Выдан","Номер пломбы": 20,"Дата чистки": "28.02.23"},{"Модель": "iRU 511MT","Серийный номер": "123123awda240",'
      '"Номер продукта": "awdajl2123adw6","Инвентрный номер": 9,"ФИО": "Воронцов Аскольд Георгьевич","Статус": "Склад","Номер пломбы": 21,"Дата чистки": "01.03.23"'
      '},{"Модель": "iRU 511MT","Серийный номер": "123123awda241","Номер продукта": "awdajl2123adp9","Инвентрный номер": 10,"ФИО": "Коновалов Мартын Пантелеймонович",'
      '"Статус": "Склад","Номер пломбы": 22,"Дата чистки": "22.02.23"}]';

  static final jsonDetailData = {
    "Серийный номер": "123123awda232",
    "Владельци": "Бобров Ипполит Эдуардович, Коновалов Мартын Пантелеймонович"
  };
}
